ПД_sev/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещатьПоСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсироватьТолькоПереработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доверенности</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПД_sev/src/Catalogs/Сотрудники/ManagerModule.bsl
Функция ПолучитьМассивСотрудников() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	НЕ Сотрудники.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("Наименование");
КонецФункции // ПолучитьМассивСотрудников()

Функция ПолучитьМассивДоступныхПроектов(СсылкаСотрудник) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиПроекты.Проект КАК Проект
	               |ИЗ
	               |	Справочник.Сотрудники.Проекты КАК СотрудникиПроекты
	               |ГДЕ
	               |	СотрудникиПроекты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СотрудникиПроекты.Проект";
	Запрос.УстановитьПараметр("Ссылка", СсылкаСотрудник);
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("Проект");	
КонецФункции
